-----------------------------------
--서브 카테고리 별 데이터 2권씩 넣기
-----------------------------------
insert into books values(seq_book_no.nextval, '구글 엔지니어는 이렇게 일한다', '한빛미디어', '구글은 어떻게 개발하고 코드를 관리하는가
지난 50년의 세월과 이 책이 입증한 사실이 한 가지 있습니다. 바로 <소프트웨어 엔지니어링의 발전은 결코 정체되지 않는다>라는 것입니다. 빠른 기술 변화 속에서 소프트웨어 엔지니어링의 중요성이 더욱 강조되면서 소프트웨어 엔지니어의 역할은 점점 더 확장될 것입니다. 이제 더 이상 소프트웨어 엔지니어링은 단순히 조직을 효과적으로 운영하는 방법에 그치지 않을 것입니다. 이 책에서는 여러분이 궁금해하고, 반드시 알아야 할 프로그램을 효과적으로 짜는 방법은 물론, 코드베이스를 지속 가능하고 건실하게 만들어주는 엔지니어링 관행까지 모두 소개합니다. 이 책 한 권이면 소프트웨어 엔지니어링 프로세스를 완벽하게 익히고 좋은 제품을 남들보다 빠르게 구현할 수 있게 됩니다. 또한 20년 넘게 수만 명의 구글러가 쌓아온 노하우도 습득할 수 있습니다. 품질 좋은 소프트웨어 제품을 신속하게 개발하고 싶거나 구글의 소프트웨어 관리 방법이 궁금한 모든 이에게 훌륭한 안내서가 되어줄 것입니다.', 45000, 704, '한국어', '2022-05-10', 10, 6);

insert into books values(seq_book_no.nextval, '혼자 공부하는 머신러닝+딥러닝', '한빛미디어','혼자 해도 충분하다! 1:1 과외하듯 배우는 인공지능 자습서
이 책은 수식과 이론으로 중무장한 머신러닝, 딥러닝 책에 지친 ‘독학하는 입문자’가 ‘꼭 필요한 내용을 제대로’ 학습할 수 있도록 구성했다. 구글 머신러닝 전문가(Google ML expert)로 활동하고 있는 저자는 여러 차례의 입문자들과 함께한 머신러닝/딥러닝 스터디와 번역ㆍ집필 경험을 통해 ‘무엇을’ ‘어떻게’ 학습해야 할지 모르는 입문자의 막연함을 이해하고, 과외 선생님이 알려주듯 친절하게 핵심적인 내용을 콕콕 집어준다. 컴퓨터 앞에서 〈손코딩〉을 따라하고, 확인 문제를 풀다 보면 그간 어렵기만 했던 머신러닝과 딥러닝을 개념을 스스로 익힐 수 있을 것이다!

- 베타리더가 함께 만든 입문서
베타리딩 과정을 통해 입문자에게 적절한 난이도, 분량, 학습 요소 등을 고민하고 반영했다. 어려운 용어와 개념은 한 번 더 풀어 쓰고, 복잡한 설명은 눈에 잘 들어오는 그림으로 풀어 냈다. ‘혼자 공부해본’ 여러 입문자의 마음과 눈높이가 책 곳곳에 반영된 것이 이 책의 가장 큰 장점이다.', 26000, 560, '한국어', '2020-12-21', 10, 6);

insert into books values(seq_book_no.nextval, '암호학과 네트워크 보안', '한티에듀', '암호학과 네트워크 보안의 초판을 쓴 저자 Behrouz A. Forouzan은 쉬운 문장 스타일과 시각적 접근 방식을 사용하여 어려운 개념들을 아주 쉽게 설명하였다.
학생들에게 필요한 어려운 수학 개념을 보다 확실하게 배울 수 있도록 구성하였다.
이 책의 주요 특징은 다음과 같다.
ㆍ 수백 개의 그림을 이용하여 중요한 개념을 시각적으로 설명하여 기술 내용을 이해하기 쉽게 만들었다.
ㆍ 유용한 프로그램을 통해 학생들이 실제로 실습해 볼 수 있다.
ㆍ 최신 네트워크 보안 기술의 적용 범위는 실제 상황에 맞는 예를 직접 적용할 수 있게 하였다.
ㆍ 각 장의 마지막에 있는 다양한 연습문제는 학생들이 배운 것을 복습하고 다양한 자료를 통해 도전할 수 있는 기회를 제공한다.', 37000, 847, '한국어', '2021-07-30', 10, 7);

insert into books values(seq_book_no.nextval, '웹 개발자를 위한 웹 보안', '에이콘출판', '웹 개발자가 알아야 할 공격과 방어를 다룬다!
매년 크게 바뀌지 않는 웹 취약점으로부터 웹사이트를 방어하기 위한 실질적인 방안을 이해하기 쉽게 설명한다. 웹 개발자라면 꼭 알아야 하는 필수 지식이며 예시와 함께 해킹에 대한 조치 방안을 알기 쉽게 표현했다.
인터넷, 브라우저가 어떻게 동작하는지부터 인젝션 공격, 파일 업로드 공격, DoS 공격의 전반적인 내용을 알아본다. 또한 특정 프로그래밍 언어에 국한되지 않아 웹 보안의 원리를 총체적으로 배우기 좋은 가이드가 될 것이다.', 25000, 252, '한국어', '2022-07-22', 10, 7);

insert into books values (seq_book_no.nextval, '이기적 SQL 개발자 이론서+기출문제', '영진닷컴', '본 도서는 한국데이터진흥원에서 시행하는 ‘SQL 개발자’ 자격의 합격을 위한 도서이다. SQL 개발자의 시험 출제 기준과 출제된 기출문제를 분석하여 핵심 내용만 엄선하였다. 과목과 섹션마다 개념을 정리할 수 있는 문제를 수록하여 이론 학습을 더욱 탄탄히 할 수 있고, 기출문제를 집중 분석하여 만들어 낸 모의고사와 기출 유형 문제를 통해서 이론을 확실하게 학습할 수 있다. 이기적 스터디 카페에서는 중요 문제 풀이 영상과 마지막 복습을 위한 핵심 마인드맵을 제공하고 질문답변 게시판을 운영하고 있다. 저자가 운영하는 임베스트 SQL 홈페이지(www.sqld.co.kr)에서도 더 많은 정보를 확인할 수 있다.',24000 ,479 ,'한국어','2022-08-10' ,10, 8);

insert into books values(seq_book_no.nextval, '오라클 튜닝 에센셜', '글봄크리에이티브', 'DB 튜닝의 이해를 넘어 체화를 위한 공격적인 시도

DB 튜닝을 이해하여 좋은 SQL을 짜고 싶은 개발자들을 위한 책이다. DB 튜닝 입문자를 위해 꼭 필요한 내용 위주로 간추려 그림으로 설명함으로써 공부 부담을 줄였다.

튜닝은 DBMS의 아키텍처 이해 등 방대한 학습이 필요한 영역이다. 하지만 대부분의 개발 프로젝트 현장에는 전담 DB 튜너가 없다. 이에 따라 개발자들이 경험을 토대로 튜닝을 한다. 이 책은 경험 단계를 뛰어넘어 튜닝을 제대로 이해하고 싶은 개발자를 위해 기획됐다.

이 책은 튜닝이라는 허들을 넘기 어려운 이유 세 가지를 염두에 두고 해결책 중심으로 구성됐다.

DB 튜닝 공부의 어려움 3가지와 해결책

① 알아야 할 내용이 많다 ▶ 필수 내용만 간추려 그림과 함께 설명
② 느린 SQL 문을 접하기 어렵다 ▶ 풍부한 실행계획 예제 제시
③ 실습 데이터 확보의 어려움 ▶ 5000만 건 이상의 실습용 데이터와 모델 제공

튜닝 경험이 없다면 시스템 속도를 저하시키는 ‘문제의 SQL문’을 접하더라도 실감하기가 쉽지 않다. 이런 독자를 위해 『오라클 튜닝 에센셜』은 직접 확인해볼 수 있도록 5000만 건 이상의 주문 테이블과 주문상품 테이블 데이터, 관련 데이터 모델을 제공한다. 책에 제시된 SQL문을 직접 적용ㆍ확인해 보고, 나만의 방법으로 고쳐보면서 공부할 수 있다.', 25000, 236, '한국어', '2020-01-02', 10, 8);

insert into books values(seq_book_no.nextval,'Do it! HTML+CSS+자바스크립트 웹 표준의 정석', '이지스퍼블리싱','웹 분야 1위! 그만한 이유가 있다!
키보드를 잡고 실습하다 보면
웹 개발의 3대 기술이 끝난다!
웹의 기본을 한 권으로 끝낼 수 있는 책이 탄생했다! 8년 연속 웹 분야 도서 1위인 《Do it! HTML5+CSS3 웹 표준의 정석》의 고경희 저자는 ‘HTML, CSS, 자바스크립트를 한 권으로’ 배우고 싶다는 많은 독자의 요구를 모아 최신 경향을 반영한 이 책을 집필했다. 웹 개발을 시작하는 입문자도 쉽게 실습할 수 있고, 중요한 문법만 다시 공부하고 싶은 중ㆍ고급자에게도 도움이 된다.
친절한 설명은 기본! 핵심만 쏙쏙 뽑아서 실무에 바로 사용할 수 있는 예제도 풍성하게 담겨 있다. 또한 최신 웹 표준 기술인 HTML5, CSS3, 자바스크립트(ES6)를 기준으로 설명하며 책의 모든 내용을 압축한 최종 프로젝트 〈웹 사이트 만들기〉 PDF 전자책을 무료로 추가 제공한다. 수많은 독자가 입을 모아 ‘웹 분야의 교과서’라고 부르는 이유를 지금 확인해 보자!', 30000, 648, '한국어', '2021-01-22', 10, 9);


insert into books values(seq_book_no.nextval, '스프링 부트 핵심 가이드', '위키북스', '입문자의 눈높이에 맞춰 차근차근 따라 하면서 배우는 스프링 부트 입문서!
《스프링 부트 핵심 가이드》는 스프링 부트 기반의 애플리케이션을 개발할 때 필요한 기초적인 내용들을 소개하고, 스프링에서 제공하는 각종 라이브러리의 기능들을 이해할 수 있게 동작 원리를 상세히 설명합니다. 또한 ‘스프링 부트’다운 코드를 작성하는 방법에 초점을 맞춰 스프링 부트에서 제공하는 편의 기능들을 최대한 활용하고, 스프링 부트 기반의 애플리케이션을 어떻게 설계하고 구현하는지 안내합니다.', 28000, 452, '한국어', '2022-06-24' ,10, 9);


insert into books values(seq_book_no.nextval, '무조건 돈 버는 카카오 이모티콘 만들기', '중앙북스', '‘목이 길어 슬픈 짐승’ ‘댜갸 탸댱해’ ‘작가님 마감이 얼마 안 남아서요..’ 등
다수의 스테디셀러 이모티콘을 만든 화제의 작가 김나무는
어떻게 ‘초대박 이모티콘’을 만들고 단숨에 부자가 되었을까?

쉽게 만들고, 한 번에 승인 받고, 많이 파는
김나무표 특급 노하우 전격 공개!

‘목이 길어 슬픈 짐승’, ‘작가님 마감이 얼마 안 남아서요’, ‘댜갸 탸댱해 시리즈’ 등 다수의 대박 이모티콘을 만든 김나무 작가가 이모티콘 승인 받는 비결과 잘 팔리는 이모티콘 만드는 법을 소개한다.
작가 김나무는 대충 그린 듯한 그림체나 똑같은 그림에 텍스트만 다르게 넣는 등 기발한 아이디어로 엄청난 화제를 모으고 있다. 이모티콘을 판매하려면 판매 플랫폼에서 승인을 받아야만 가능한데, 김나무 작가는 승인 단계가 까다롭기로 유명한 카카오에서 6년간 무려 64개의 이모티콘을 승인 받았다. 그중 카카오에 처음으로 출시한 이모티콘 ‘목이 길어 슬픈 짐승’은 출시하자마자 선풍적인 인기를 끌어 출시한 첫 달에만 1억 2천만 원이라는 어마어마한 수익을 낸 바 있다. 그 이후에도 출시하는 이모티콘마다 인기를 끌며 ‘이모티콘 계의 신의 손’으로 불리고 있다.
김나무 작가는 이 책을 통해 그림을 잘 그리지 못해도, 아이디어와 기획력 하나만으로 누구나 ‘잘 팔리는’ 이모티콘을 만들 수 있는 비결을 알려준다. 트렌드를 파악하고 잘 팔리는 이모티콘을 만들기 위해 세워야 하는 전략을 분석하고, 종류별 이모티콘 만드는 법부터 본격 카카오 이모티콘 스튜디오에 제안하는 방법, 내가 만든 캐릭터로 굿즈를 제작해 부가수익을 창출하는 방법까지 낱낱이 파헤친다.', 17500, 216,'한국어' ,'2022-06-01', 10, 10);


insert into books values(seq_book_no.nextval, '리액트 네이티브를 다루는 기술', '길벗','입문부터 실무까지 한 권으로!
네이티브 코드 연동과 서드 파티 라이브러리로 생산성과 개발 효율을 높인다.
이 책의 목표는 리액트 네이티브의 기초 개념과 실제로 활용하는 데 필요한 지식을 쉽게 배우고, 궁극적으로 자신이 만들고 싶은 모바일 앱을 직접 개발할 수 있도록 돕는 것이다. 수월하게 학습할 수 있도록 필요한 기본 지식(리액트, 타입스크립트, 관련 라이브러리 등)을 수록하고, 단계별로 상세하게 실습하면서 기본기를 익힐 수 있도록 했다. 또한, 프로젝트 개발의 전반적인 내용을 파악하고 실무에 응용할 수 있도록 예제 프로젝트는 처음부터 끝까지 온전히 전체를 직접 만들어본다. To do list, 다이어리 앱, 사진 공유 앱, 게시판 프로젝트를 만들면서 리액트 네이티브의 핵심 기능은 물론, 리액트 네이티브로 프로젝트를 개발할 때 자신감을 더해줄 필수 지식들을 배울 수 있다.' ,43000, 992, '한국어', '2021-10-31', 10, 10);

commit;


